Repository: vixriihi/Desent-helper
Catalog: src/locale/*.xlf
Languages: fi

source: Classes
fi: Luokat

source: Disciple
fi: Opetuslapsi

source: Knight
fi: Ritari

source: Home
fi: Etusivu

source: Armor
fi: Haarniska

source: One Hand
fi: Yhdenkäden

source: Two Hand
fi: Kahdenkäden

source: Other
fi: Muu

source: Items
fi: Esineet

source: Armor
fi: Haarniska

source: One Hand
fi: Yhdenkäden

source: Two Hand
fi: Kahdenkäden

source: Other
fi: Muu

source: Armor of Faith
fi: Uskon Haarniska

source: Each time you use Prayer of Healing on a hero, that hero adds 1 additional brown die to his defense pool until the start of your next turn.{LINE_BREAK} Place a hero token belonging to that hero on this card as a reminder.
fi: Jokainen kerta kun käytät Parantavaa Rukousta sankariin, sankari saa 1 ruskean nopan lisää hänen puolustukseen sinun seuraavaan vuoron alkuun asti. Muistaaksesi tämän laita hänen sankarimerkki tämän kortin päälle.

source: Blessed Strike
fi: Siunattu Isku

source: ∞: Perform an attack with a Melee weapon. If you deal at least 1 ≥ (after rolling defense dice), you and 1 hero of your choice adjacent to you each recover 2 ≥.
fi: ∞: Hyökkää lähitaisteluaseella. Jos teet edes 1 ≥ (puolustus noppien heiton jälkeen), sinä ja 1 vieressäsi oleva sankari paranee 2 ≥.

source: Cleansing Touch
fi: Puhdistava Kosketus

source: Each time you use Prayer of Healing on a hero, that hero may also discard 1 of his Condition cards.
fi: Jokainen kerta kun käytät Parantavaa Rukousta sankariin, sankari voi myös poistaa 1 hänen Olotilakorteista.

source: Divine Fury
fi: Pyhä Raivo

source: Each time you use Prayer of Healing on a hero, that hero adds 1 additional yellow power die to his attack pool on his next attack this round. Place a hero token belonging to that hero on this card as a reminder.
fi: Jokainen kerta kun käytät Parantavaa Rukousta sankariin, sankari saa 1 keltaisen voima nopan lisää hänen seuraavaan hyökkäykseen. Muistaaksesi tämän laita hänen sankarimerkki tämän kortin päälle.

source: Holy Power
fi: Pyhä Voima

source: Your Prayer of Healing may now affect 2 different heroes. If you roll a ± on the red power die when using Prayer of Healing, both heroes recover 1 ∏.
fi: Sinun Parantava Rukous voi nyt vaikuttaa 2 sankariin. Jos heität ± punaisella voima nopalla, kun käytät Parantavaa Rukousta, kumpikin sankari paranee 1 ∏.

source: Prayer of Healing
fi: Parantava Rukous

source: Exhaust this card during your turn and choose yourself or an adjacent hero. Roll 1 red power die. The chosen hero recovers ≥ equal to the ≥ rolled.
fi: Kuluta tämä kortti vuorollasi ja valitse itsesi tai vieressäsi oleva sankari. Heitä 1 punainen voimanoppa. Valittu sankari paranee ≥ heitettyjen ≥ verran.

source: Prayer of Peace
fi: Rauhan Rukous

source: ∞: Exhaust this card.{LINE_BREAK} While this card is exhausted, monsters cannot perform an attack while adjacent to you.
fi: ∞: Kuluta tämä kortti. Niin kauan kuin tämä kortti on kulutettuna, hirviöt eivät voi hyökätä, kun he ovat vieressäsi.

source: Radiant Light
fi: Säteilevä Valo

source: ∞: Roll 1 red power die. Each hero in your line of sight (including yourself) recovers the amount of ≥ rolled. Each monster in your line of sight suffers the amount of ≥ rolled.
fi: ∞: Heitä 1 punainen voima noppa. Jokainen sankari johon sinulla on näköyhteys (myös sinä itse) paranee heitettyjen ≥ verran. Jokainen hirviö näkökentässäsi kärsii heitettyjen ≥ verran.

source: Time of Need
fi: Tarveaika

source: ∞: You receive 2 movement points and recover 2 ≥.
fi: ∞: Saat 2 liikkumis pistettä ja 2 ≥.

source: Advance
fi: Etene

source: After defeating a monster with an attack using a Melee weapon, exhaust this card to move up to you Speed and perform an additional attack.
fi: Voitettuasi hirviö lähitaisteluaseella, kuluta tämä kortti ja liiku nopeutesi verran ja tee uusi hyökkäys.

source: Challenge
fi: Haasta

source: Exhaust this card to choose a monster in you line of sight and place your hero token on it. While this card is exhausted, each attack performed by you or the monster, when targeting each other, gains +1 ≥.
fi: Kuluta tämä kortti ja valitse hirviö johon sinulla on näköyhteys ja laita sankarimerkkisi sille. Niin kauan kuin tämä korti on kulutettuna, jokainen toisiinne kohdistuva hyökkäys, jonka sinä tai valittu hirviö suorittaa, saa +1 ≥.

source: Defend
fi: Puolusta

source: When a hero adjacent to you is targeted by an attack, use this card to instead declare yourself as the target of the attack. Range and line of sight are still measured to the targeted hero's space.
fi: Kun hyökkäyksen kohteena oleva sankari on vieressäsi, käytä tätä korttia ilmoittaaksesi itsesi, sankarin sijasta, hyökkäyksen kohteeksi. Etäisyys ja näköyhteys mitataan edelleen hyökkäyksen kohteena ollesta sankarista.

source: Defense Training
fi: Puolustuskoulutus

source: As long as you have a Shield equipped, add 1 additional brown die to your defense pool (even if this card is exhausted). When you would exhaust your equipped Shield (such as to use the Shield's ability), you may exhaust this card instead.
fi: Niin kauan kuin sinulla on suoja varustettuna, lisää 1 ruskea noppa puolustukseesi (vaikka tämä kortti olisi kulutettuna). Kun kuluttaisit varustetun suojasi (kuten jonkin suojan kyvyistä), voit kuluttaa kortin sen sijaan.

source: Guard
fi: Vartioi

source: When a monster moves into an empty space adjacent to you, exhaust this card to interrupt that monster’s activation and perform an attack with a Melee weapon. After this attack is resolved, if the monster was not defeated, it may continue its activation.
fi: Kun hirviö liikkuu tyhjään ruuttuun vieressäsi, kuluta tämä kortti keskeyttääksesi hirviön vuoro ja suorita hyökkäys lähitaisteluaseella. Kun tämä hyökkäys on ratkaistu, jos hirviötä ei voiteta, se voi jatkaa vuoroaan.

source: Inspiration
fi: Inspiraatio

source: At the start of your turn. if you are adjacent to at least one other hero, you and each other hero adjacent to your recover 1 ∏.
fi: Sinun vuorosi alussa. Jos olet vähintään yhden muun sankarin vieressä, sinä ja toiset sankarit, toipuvat 1 ∏.

source: Oath of Honor
fi: Kunnian Vala

source: ∞: Choose another hero within 3 spaces of you who has a monster adjacent to him. Place your hero figure in the closest empty space adjacent to the monster and perform an attack with a Melee weapon against that monster.
fi: ∞: Valitse toinen sankari 3 enintään kolmen ruudun päästä sinusta ja jonka vieressä on hirviö. Siirrä sankarisi lähimpään tyhjään ruutuun hirviön vieressä ja tee hyökkäys lähitaisteluaseella tätä hirviötä vastaan.

source: Shield Slam
fi: Suoja Isku

source: While you have a Shield equipped (even if exhausted), each of your attacks with a Melee weapon gain:{LINE_BREAK} ±: Choose a monster adjacent to you. That monster is Stunned.
fi: Kun sinulla on suoja varustettuna (vaikka se olisikin kulutettuna), jokainen hyökkäys saa: ±: Valitse vieressäsi oleva hirviö. Se hirviö pökertyy.

source: Stalwart
fi: Roteva

source: You gain +2 Health. When you are defeated, you may immediatly move up to your Speed and perform an attack with a Melee weapon. After the attack is resolved, you are knocked out.
fi: Saat +2 elämää. Kun sinut on voitettu, voit liikkua välittömästi nopeutesi verran ja suorittaa hyökkäys lähitaisteluaseella. Kun hyökkäys on ratkaistu, olet edelleen voitettuna.

source: Leather Armor
fi: Nahka haarniska

source: You gain +1 Health.
fi: Saat +1 Elämää.

source: Chainmail
fi: Rengashaarniska

source: You cannot equip Runes.
fi: Et voi käyttää Riimuja

source: Your Speed is reduced to 4 and cannot be increased above 4.
fi: Sinun nopeutesi laskee 4:ään eikä voi nousta yli 4:än.

source: Heavy Cloak
fi: Raskas Viitta

source: Exhaust this card after the dice are rolled to cancel 1 ± on an attack that targets you.
fi: Kuluta tämä kortti noppien heiton jälkeen peruaksesi 1 ± hyökkäyksestä joka kohdistuu sinuun.

source: Light Hammer
fi: Kevyt Vasara

source: ±: Stun
fi: ±: Pökerryttä

source: Sling
fi: Ritsa

source: ±: +1 Range, +1 ≥
fi: ±: +1 Etäisyyteen, +1 ≥

source: Iron Shield
fi: Rautainen Kilpi

source: Exhaust this card after rolling defense dice to either reroll one die or add 1 Shield to the results.
fi: Kuluta tämä kortti puolustusnoppien heiton jälkeen, joko heittääksesi uudestaan yhtä noppaa tai lisätäksesi 1 kilven tulokseen.

source: Iron Spear
fi: Rautanen Keihäs

source: Reach
fi: Ulottuva

source: ±: Pierce 1
fi: ±: Lävistää 1

source: Crossbow
fi: Jousipyssy

source: Pierce 1
fi: Lävistää 1

source: ±: +2 ≥ and move the target 1 space
fi: ±: +2 ≥ ja liikuta kohdetta 1 ruutu

source: Steel Broadsword
fi: Teräksinen Miekka

source: Once per attack roll, you may reroll 1 red power die.
fi: Kerran jokaisessa hyökkäys heitossa voit heittää uudelleen 1:tä punaista voima noppa.

source: Sunburst
fi: Auringonpurkaus

source: Immolation
fi: Polttaja

source: ±: +1 Range
fi: ±: +1 Etäisyyteen

source: Adjacent figures do not block your line of sight.
fi: Vieressäsi olevat hahmot eivät estä näköyhteyttäsi.

source: ±: +2 Range
fi: ±: +2 Etäisyyteen

source: Magic Staff
fi: Maaginen Sauva

source: ±: Deal 1 ≥ to another monster within 3 spaces of the target
fi: ±: Aiheuta 1 ≥ toiselle hirviölle 3:n ruudun päässä kohteesta

source: Iron Battleaxe
fi: Rautanen Taistelukirves

source: Scorpion Helm
fi: Skorppioni Kypärä

source: Your Ranged attacks gain +1 Range.
fi: saat +1 etäisyyteen.

source: Limit 1 Helmet equipped at a time.
fi: Rajoitus 1 Kypärä voi olla varustettuna saman aikaisesti.

source: Lucky Charm
fi: Onnenamuletti

source: Exhaust this card to reroll an attribute test. You must keep the new results.
fi: Kuluta tämä kortti ja heitä uudestaan kyky testissä. Sinun pitää hyväksyä uusi tulos.

source: Mana Weave
fi: Taikavoima Aalto

source: After rolling attack dice, exhaust this card to add 1 ± to the results.
fi: Hyökkäys noppien heiton jälkeen, kuluta tämä kortti lisätäksesi 1 ± tulokseen

source: You gain +1 Stamina.
fi: Saat +1 Kestävyyttä.

source: Demonhide Leather
fi: Demonin Nahka

source: When you perform 2 move actions on your turn, suffer 1 ∏ at the end of your turn.
fi: Kun teet 2 liikkumis toimintoa, kärsit 1 ∏ vuorosi lopussa.

source: Dragontooth Hammer
fi: Lohikäärmehammas Vasara

source: If your other hand is empty, your attacks gain +1 ≥.
fi: Jos toinen kätesi on tyhjä, hyökkäyksesi saavat +1 ≥.

source: ±: Pierce 2
fi: ±: Lävistää 2

source: Dwarven Firebomb
fi: Kääpiöiden Tulipommi

source: ±: Blast
fi: ±: Räjähdys

source: Elven Cloak
fi: Haltiaviitta

source: Exhaust this card after rolling defense dice to replace the results with a number of ≤ equal to your µ
fi: Kuluta tämä kortti puolustusnoppien heiton jälkeen ja korvaa tulokset numeroilla ≤:ä jotka vastaa sinun µ

source: Grinding Axe
fi: Lohduton Kirves

source: Heavy Steel Shield
fi: Raskas Teräskilpi

source: Exhaust this card after rolling defense dice to reroll 1 defence die and add 1 ≤ to the results.
fi: Kuluta tämä kortti puolustusnoppien heiton jälkeen, heittääksesi uudestaan 1 pulustus noppaa ja lisätäksesi 1 ≤ tulokseen.

source: Ice Storm
fi: Jää Myrsky

source: ±: Immobilize
fi: ±: Tee liikunta kyvyttömäksi

source: Iron-Bound Ring
fi: Raudoitettu Sormus

source: You gain +2 Health.
fi: Saat +2 Elämää.

source: If you roll one or more blanks when rolling defence dice, add 1 ≤ to your results.
fi: Jos heität yhden tai useamman tyhjän kun heität puolustusnoppia, lisää 1 ≤ tulokseesi.

source: Latari Longbow
fi: Latari Pitkäjouse

source: Mace of Kellos
fi: Kelloksen Nuija

source: ±: Each monster adjacent to you suffers 1 ≥
fi: ±: Jokainen hirviö viereälläsi kärsii 1 ≥

source: ±: Recover +1 ≥
fi: ±: Toivu +1 ≥

source: Platemail
fi: Levyhaarniska

source: Your Speed is reduced to 3 and cannot be increased above 3.
fi: Sinun nopeutesi laskee 3:een eikä voi nousta yli 3:en.

source: Steel Greatsword
fi: Teräksinen Pitkämiekka

source: Once per attack, you may reroll 1 power die.
fi: Kerran jokaisessa hyökkäys heitossa voit heittää uudelleen 1:tä voima noppa.

source: Tival Crystal
fi: Tivalin kristalli

source: ∞: Exhaust this card to roll 1 red power die. You recover ≥ equal to the ≥ rolled.
fi: ∞: Kuluta tämä kortti ja heitä 1 punaista voima noppaa. Paranet ≥ sen verran kuin mitä heitit ≥.

source: Character
fi: Hahmo

source: Descent helper
fi: Descent apuri
